rocksdb/ssd/workloadf.log
/home/hustzyw/jdk1.8.0_191/bin/java -cp /home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/rocksdb-binding/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/core-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jcip-annotations-1.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-api-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-simple-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/rocksdb-binding-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/fb-rocksdbjni-5.18.0.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadf -p rocksdb.dir=/mnt/ssd/ycsb-rocksdb-xiaohu -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadf -p rocksdb.dir=/mnt/ssd/ycsb-rocksdb-xiaohu -t
YCSB Client 0.15.0

Loading workload...
Starting test.
[Thread-3] INFO com.yahoo.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /mnt/ssd/ycsb-rocksdb-xiaohu
2018-12-30 10:06:36:133 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-30 10:06:46:076 10 sec: 17773 operations; 1776.23 current ops/sec; est completion in 1 hour 33 minutes [READ: Count=17773, Max=182783, Min=1, Avg=460.14, 90=1295, 99=2215, 99.9=5011, 99.99=172159] [READ-MODIFY-WRITE: Count=8752, Max=185855, Min=7, Avg=533.45, 90=1377, 99=2355, 99.9=8639, 99.99=178047] [UPDATE: Count=8752, Max=1438, Min=4, Avg=46.43, 90=76, 99=138, 99.9=245, 99.99=1240] 
2018-12-30 10:06:56:071 20 sec: 66693 operations; 4894.45 current ops/sec; est completion in 49 minutes [READ: Count=48924, Max=153471, Min=3, Avg=183.09, 90=448, 99=1421, 99.9=2051, 99.99=65791] [READ-MODIFY-WRITE: Count=24429, Max=154879, Min=17, Avg=214.4, 90=498, 99=1500, 99.9=2141, 99.99=31039] [UPDATE: Count=24439, Max=30111, Min=11, Avg=34.36, 90=50, 99=95, 99.9=117, 99.99=171] 
2018-12-30 10:07:06:072 30 sec: 128503 operations; 6180.38 current ops/sec; est completion in 38 minutes [READ: Count=61815, Max=16247, Min=3, Avg=142.01, 90=429, 99=637, 99.9=766, 99.99=1121] [READ-MODIFY-WRITE: Count=30971, Max=16895, Min=17, Avg=175.56, 90=477, 99=690, 99.9=832, 99.99=3535] [UPDATE: Count=30967, Max=12319, Min=11, Avg=32.1, 90=48, 99=66, 99.9=118, 99.99=140] 
2018-12-30 10:07:16:072 40 sec: 192915 operations; 6441.84 current ops/sec; est completion in 33 minutes [READ: Count=64410, Max=33567, Min=3, Avg=136.02, 90=419, 99=625, 99.9=765, 99.99=1603] [READ-MODIFY-WRITE: Count=32260, Max=33983, Min=17, Avg=170.7, 90=468, 99=680, 99.9=835, 99.99=3573] [UPDATE: Count=32264, Max=1206, Min=12, Avg=31.21, 90=47, 99=62, 99.9=109, 99.99=130] 
2018-12-30 10:07:26:076 50 sec: 261026 operations; 6807.02 current ops/sec; est completion in 31 minutes [READ: Count=68121, Max=1365, Min=3, Avg=128.21, 90=403, 99=609, 99.9=731, 99.99=866] [READ-MODIFY-WRITE: Count=34219, Max=14263, Min=17, Avg=160.23, 90=450, 99=656, 99.9=782, 99.99=952] [UPDATE: Count=34216, Max=13679, Min=12, Avg=30.47, 90=44, 99=60, 99.9=109, 99.99=135] 
2018-12-30 10:07:36:074 60 sec: 329216 operations; 6822.41 current ops/sec; est completion in 29 minutes [READ: Count=68180, Max=21247, Min=1, Avg=126.82, 90=404, 99=612, 99.9=743, 99.99=913] [READ-MODIFY-WRITE: Count=34005, Max=60479, Min=6, Avg=162.08, 90=454, 99=664, 99.9=808, 99.99=6071] [UPDATE: Count=34007, Max=60095, Min=3, Avg=32.84, 90=47, 99=62, 99.9=114, 99.99=1762] 
2018-12-30 10:07:46:077 70 sec: 398705 operations; 6945.43 current ops/sec; est completion in 28 minutes [READ: Count=69491, Max=31343, Min=2, Avg=124.81, 90=400, 99=606, 99.9=733, 99.99=861] [READ-MODIFY-WRITE: Count=34709, Max=31567, Min=12, Avg=159.83, 90=449, 99=659, 99.9=791, 99.99=956] [UPDATE: Count=34711, Max=10775, Min=7, Avg=31.28, 90=47, 99=61, 99.9=109, 99.99=130] 
2018-12-30 10:07:56:072 80 sec: 470344 operations; 7167.48 current ops/sec; est completion in 27 minutes [READ: Count=71646, Max=6783, Min=3, Avg=120.6, 90=395, 99=601, 99.9=731, 99.99=871] [READ-MODIFY-WRITE: Count=35782, Max=7099, Min=17, Avg=152.95, 90=440, 99=651, 99.9=789, 99.99=1093] [UPDATE: Count=35780, Max=2395, Min=12, Avg=30.46, 90=45, 99=61, 99.9=113, 99.99=128] 
2018-12-30 10:08:06:076 90 sec: 542779 operations; 7239.88 current ops/sec; est completion in 26 minutes [READ: Count=72423, Max=56831, Min=3, Avg=118.84, 90=390, 99=599, 99.9=718, 99.99=852] [READ-MODIFY-WRITE: Count=36082, Max=22239, Min=18, Avg=151.46, 90=437, 99=651, 99.9=781, 99.99=920] [UPDATE: Count=36079, Max=10391, Min=12, Avg=30.24, 90=45, 99=60, 99.9=109, 99.99=129] 
2018-12-30 10:08:16:071 100 sec: 615333 operations; 7259.03 current ops/sec; est completion in 25 minutes [READ: Count=72562, Max=25007, Min=3, Avg=116.69, 90=388, 99=594, 99.9=727, 99.99=861] [READ-MODIFY-WRITE: Count=36154, Max=36703, Min=18, Avg=150.44, 90=435, 99=643, 99.9=787, 99.99=950] [UPDATE: Count=36154, Max=36479, Min=12, Avg=31.9, 90=46, 99=61, 99.9=109, 99.99=133] 
2018-12-30 10:08:26:076 110 sec: 689948 operations; 7457.77 current ops/sec; est completion in 24 minutes [READ: Count=74612, Max=915, Min=3, Avg=114.24, 90=380, 99=586, 99.9=708, 99.99=834] [READ-MODIFY-WRITE: Count=37413, Max=86015, Min=18, Avg=149.29, 90=428, 99=635, 99.9=772, 99.99=841] [UPDATE: Count=37412, Max=85439, Min=13, Avg=32.57, 90=46, 99=61, 99.9=110, 99.99=129] 
2018-12-30 10:08:36:072 120 sec: 765660 operations; 7574.99 current ops/sec; est completion in 24 minutes [READ: Count=75711, Max=40287, Min=1, Avg=113.29, 90=376, 99=582, 99.9=722, 99.99=876] [READ-MODIFY-WRITE: Count=37744, Max=40735, Min=6, Avg=146.19, 90=424, 99=631, 99.9=783, 99.99=1198] [UPDATE: Count=37750, Max=10887, Min=4, Avg=30.72, 90=46, 99=61, 99.9=109, 99.99=129] 
2018-12-30 10:08:46:075 130 sec: 842615 operations; 7693.19 current ops/sec; est completion in 23 minutes [READ: Count=76967, Max=23055, Min=3, Avg=111.39, 90=369, 99=580, 99.9=714, 99.99=881] [READ-MODIFY-WRITE: Count=38573, Max=23471, Min=18, Avg=142.68, 90=417, 99=631, 99.9=771, 99.99=1735] [UPDATE: Count=38570, Max=15623, Min=13, Avg=30.44, 90=45, 99=60, 99.9=109, 99.99=130] 
2018-12-30 10:08:56:072 140 sec: 921526 operations; 7893.47 current ops/sec; est completion in 23 minutes [READ: Count=78897, Max=61663, Min=1, Avg=108.25, 90=360, 99=570, 99.9=703, 99.99=786] [READ-MODIFY-WRITE: Count=39657, Max=61791, Min=6, Avg=140.59, 90=406, 99=614, 99.9=759, 99.99=854] [UPDATE: Count=39659, Max=37023, Min=3, Avg=30.14, 90=44, 99=59, 99.9=108, 99.99=136] 
2018-12-30 10:09:06:076 150 sec: 1000533 operations; 7896.75 current ops/sec; est completion in 22 minutes [READ: Count=79010, Max=116223, Min=1, Avg=108.54, 90=355, 99=569, 99.9=694, 99.99=804] [READ-MODIFY-WRITE: Count=39524, Max=6639, Min=5, Avg=137.32, 90=402, 99=615, 99.9=745, 99.99=863] [UPDATE: Count=39519, Max=6251, Min=4, Avg=29.52, 90=44, 99=59, 99.9=110, 99.99=126] 
2018-12-30 10:09:16:071 160 sec: 1081268 operations; 8077.54 current ops/sec; est completion in 22 minutes [READ: Count=80737, Max=23279, Min=2, Avg=105.09, 90=345, 99=560, 99.9=692, 99.99=900] [READ-MODIFY-WRITE: Count=40513, Max=44959, Min=10, Avg=137.29, 90=396, 99=615, 99.9=754, 99.99=945] [UPDATE: Count=40517, Max=44639, Min=4, Avg=30.67, 90=44, 99=60, 99.9=110, 99.99=129] 
2018-12-30 10:09:26:075 170 sec: 1160759 operations; 7945.92 current ops/sec; est completion in 21 minutes [READ: Count=79483, Max=6035, Min=2, Avg=106.28, 90=327, 99=565, 99.9=700, 99.99=835] [READ-MODIFY-WRITE: Count=39676, Max=6539, Min=6, Avg=138.53, 90=381, 99=616, 99.9=770, 99.99=1049] [UPDATE: Count=39672, Max=6283, Min=4, Avg=31, 90=48, 99=62, 99.9=113, 99.99=131] 
2018-12-30 10:09:36:072 180 sec: 1242868 operations; 8214.19 current ops/sec; est completion in 21 minutes [READ: Count=82108, Max=21487, Min=3, Avg=103.45, 90=305, 99=551, 99.9=683, 99.99=823] [READ-MODIFY-WRITE: Count=40887, Max=4283, Min=17, Avg=135.46, 90=362, 99=603, 99.9=730, 99.99=844] [UPDATE: Count=40885, Max=162, Min=12, Avg=30.03, 90=45, 99=60, 99.9=110, 99.99=140] 
2018-12-30 10:09:46:077 190 sec: 1327650 operations; 8473.96 current ops/sec; est completion in 20 minutes [READ: Count=84786, Max=25343, Min=3, Avg=100.03, 90=293, 99=542, 99.9=677, 99.99=872] [READ-MODIFY-WRITE: Count=42348, Max=11519, Min=18, Avg=131.04, 90=338, 99=592, 99.9=729, 99.99=914] [UPDATE: Count=42348, Max=10831, Min=12, Avg=29.41, 90=44, 99=56, 99.9=94, 99.99=115] 
2018-12-30 10:09:56:071 200 sec: 1412835 operations; 8522.76 current ops/sec; est completion in 20 minutes [READ: Count=85181, Max=8999, Min=3, Avg=99.31, 90=292, 99=535, 99.9=667, 99.99=764] [READ-MODIFY-WRITE: Count=42803, Max=905, Min=18, Avg=130.47, 90=338, 99=586, 99.9=718, 99.99=803] [UPDATE: Count=42806, Max=143, Min=13, Avg=29.31, 90=44, 99=58, 99.9=108, 99.99=125] 
2018-12-30 10:10:06:076 210 sec: 1498972 operations; 8609.4 current ops/sec; est completion in 19 minutes [READ: Count=86141, Max=35327, Min=3, Avg=97.97, 90=285, 99=530, 99.9=664, 99.99=852] [READ-MODIFY-WRITE: Count=43382, Max=24911, Min=18, Avg=128.78, 90=329, 99=584, 99.9=729, 99.99=917] [UPDATE: Count=43389, Max=208, Min=13, Avg=29.54, 90=44, 99=60, 99.9=110, 99.99=131] 
2018-12-30 10:10:16:070 220 sec: 1583467 operations; 8454.57 current ops/sec; est completion in 19 minutes [READ: Count=84491, Max=27215, Min=1, Avg=98.56, 90=276, 99=533, 99.9=681, 99.99=839] [READ-MODIFY-WRITE: Count=42224, Max=27583, Min=6, Avg=131.43, 90=327, 99=591, 99.9=738, 99.99=4391] [UPDATE: Count=42223, Max=15543, Min=4, Avg=30.91, 90=47, 99=61, 99.9=112, 99.99=150] 
2018-12-30 10:10:26:077 230 sec: 1670533 operations; 8701.38 current ops/sec; est completion in 19 minutes [READ: Count=87070, Max=14399, Min=2, Avg=96.99, 90=262, 99=528, 99.9=676, 99.99=883] [READ-MODIFY-WRITE: Count=43648, Max=14463, Min=16, Avg=127.99, 90=312, 99=583, 99.9=726, 99.99=1056] [UPDATE: Count=43655, Max=142, Min=12, Avg=29.21, 90=45, 99=60, 99.9=112, 99.99=132] 
2018-12-30 10:10:36:072 240 sec: 1754757 operations; 8426.61 current ops/sec; est completion in 18 minutes [READ: Count=84222, Max=25439, Min=3, Avg=99.9, 90=274, 99=535, 99.9=677, 99.99=819] [READ-MODIFY-WRITE: Count=42243, Max=25855, Min=17, Avg=132.23, 90=327, 99=593, 99.9=734, 99.99=1017] [UPDATE: Count=42233, Max=4915, Min=11, Avg=30.58, 90=48, 99=63, 99.9=115, 99.99=140] 
2018-12-30 10:10:46:076 250 sec: 1842267 operations; 8747.5 current ops/sec; est completion in 18 minutes [READ: Count=87512, Max=11703, Min=3, Avg=96.19, 90=261, 99=507, 99.9=645, 99.99=779] [READ-MODIFY-WRITE: Count=43651, Max=8231, Min=17, Avg=126.51, 90=308, 99=552, 99.9=691, 99.99=816] [UPDATE: Count=43649, Max=1105, Min=12, Avg=29.78, 90=46, 99=62, 99.9=113, 99.99=143] 
2018-12-30 10:10:56:071 260 sec: 1928448 operations; 8621.55 current ops/sec; est completion in 18 minutes [READ: Count=86178, Max=26495, Min=3, Avg=96.86, 90=263, 99=517, 99.9=669, 99.99=843] [READ-MODIFY-WRITE: Count=43492, Max=26687, Min=16, Avg=130.25, 90=315, 99=581, 99.9=743, 99.99=2175] [UPDATE: Count=43498, Max=23007, Min=12, Avg=31.13, 90=48, 99=63, 99.9=117, 99.99=153] 
2018-12-30 10:11:06:071 270 sec: 2015991 operations; 8755.18 current ops/sec; est completion in 17 minutes [READ: Count=87544, Max=44543, Min=3, Avg=95.73, 90=262, 99=501, 99.9=654, 99.99=766] [READ-MODIFY-WRITE: Count=43868, Max=9671, Min=17, Avg=127.61, 90=313, 99=566, 99.9=717, 99.99=829] [UPDATE: Count=43861, Max=9487, Min=12, Avg=30.33, 90=47, 99=62, 99.9=114, 99.99=140] 
2018-12-30 10:11:16:071 280 sec: 2104898 operations; 8889.81 current ops/sec; est completion in 17 minutes [READ: Count=88907, Max=100863, Min=3, Avg=94.16, 90=255, 99=482, 99.9=660, 99.99=758] [READ-MODIFY-WRITE: Count=44488, Max=101119, Min=18, Avg=127.18, 90=304, 99=555, 99.9=713, 99.99=882] [UPDATE: Count=44492, Max=1554, Min=13, Avg=30.07, 90=46, 99=62, 99.9=115, 99.99=138] 
2018-12-30 10:11:26:075 290 sec: 2194670 operations; 8973.61 current ops/sec; est completion in 17 minutes [READ: Count=89772, Max=32831, Min=2, Avg=92.32, 90=255, 99=463, 99.9=636, 99.99=757] [READ-MODIFY-WRITE: Count=44958, Max=48287, Min=8, Avg=125.55, 90=306, 99=530, 99.9=696, 99.99=965] [UPDATE: Count=44957, Max=47935, Min=5, Avg=31.55, 90=48, 99=63, 99.9=114, 99.99=138] 
2018-12-30 10:11:36:072 300 sec: 2283868 operations; 8923.37 current ops/sec; est completion in 16 minutes [READ: Count=89199, Max=17263, Min=3, Avg=92.86, 90=258, 99=456, 99.9=632, 99.99=739] [READ-MODIFY-WRITE: Count=44510, Max=17631, Min=18, Avg=126.45, 90=311, 99=516, 99.9=695, 99.99=842] [UPDATE: Count=44510, Max=8959, Min=12, Avg=31.64, 90=50, 99=64, 99.9=110, 99.99=137] 
2018-12-30 10:11:46:077 310 sec: 2373867 operations; 8995.4 current ops/sec; est completion in 16 minutes [READ: Count=90011, Max=55167, Min=3, Avg=92.55, 90=257, 99=457, 99.9=636, 99.99=818] [READ-MODIFY-WRITE: Count=45272, Max=26703, Min=18, Avg=124.24, 90=307, 99=508, 99.9=690, 99.99=810] [UPDATE: Count=45271, Max=895, Min=12, Avg=30.45, 90=47, 99=62, 99.9=116, 99.99=137] 
2018-12-30 10:11:56:074 320 sec: 2466160 operations; 9232.07 current ops/sec; est completion in 16 minutes [READ: Count=92281, Max=18015, Min=3, Avg=89.86, 90=253, 99=448, 99.9=631, 99.99=757] [READ-MODIFY-WRITE: Count=46310, Max=18351, Min=18, Avg=122.23, 90=302, 99=502, 99.9=694, 99.99=827] [UPDATE: Count=46313, Max=1807, Min=13, Avg=30.26, 90=47, 99=63, 99.9=115, 99.99=137] 
2018-12-30 10:12:06:076 330 sec: 2557533 operations; 9135.47 current ops/sec; est completion in 16 minutes [READ: Count=91372, Max=12215, Min=3, Avg=88.92, 90=253, 99=446, 99.9=633, 99.99=746] [READ-MODIFY-WRITE: Count=45676, Max=102271, Min=18, Avg=122.83, 90=302, 99=498, 99.9=701, 99.99=840] [UPDATE: Count=45673, Max=101887, Min=12, Avg=32.48, 90=47, 99=62, 99.9=113, 99.99=138] 
2018-12-30 10:12:16:073 340 sec: 2649310 operations; 9179.54 current ops/sec; est completion in 15 minutes [READ: Count=91774, Max=17695, Min=3, Avg=89.35, 90=254, 99=446, 99.9=632, 99.99=744] [READ-MODIFY-WRITE: Count=45733, Max=8199, Min=18, Avg=123.12, 90=306, 99=503, 99.9=707, 99.99=871] [UPDATE: Count=45730, Max=7807, Min=11, Avg=31.6, 90=49, 99=65, 99.9=119, 99.99=144] 
2018-12-30 10:12:26:072 350 sec: 2742968 operations; 9366.74 current ops/sec; est completion in 15 minutes [READ: Count=93661, Max=20223, Min=3, Avg=87.58, 90=252, 99=443, 99.9=617, 99.99=747] [READ-MODIFY-WRITE: Count=46782, Max=67583, Min=18, Avg=121.6, 90=302, 99=494, 99.9=664, 99.99=847] [UPDATE: Count=46788, Max=67135, Min=12, Avg=31.86, 90=47, 99=62, 99.9=117, 99.99=143] 
2018-12-30 10:12:36:072 360 sec: 2835670 operations; 9271.13 current ops/sec; est completion in 15 minutes [READ: Count=92701, Max=95359, Min=3, Avg=88.64, 90=255, 99=443, 99.9=629, 99.99=773] [READ-MODIFY-WRITE: Count=46319, Max=20175, Min=15, Avg=119.81, 90=304, 99=496, 99.9=683, 99.99=851] [UPDATE: Count=46312, Max=1550, Min=10, Avg=30.27, 90=47, 99=62, 99.9=115, 99.99=135] 
2018-12-30 10:12:46:071 370 sec: 2932502 operations; 9684.17 current ops/sec; est completion in 14 minutes [READ: Count=96834, Max=19967, Min=3, Avg=84.76, 90=251, 99=435, 99.9=611, 99.99=713] [READ-MODIFY-WRITE: Count=48227, Max=24095, Min=18, Avg=117.57, 90=300, 99=490, 99.9=665, 99.99=825] [UPDATE: Count=48231, Max=23647, Min=11, Avg=30.61, 90=47, 99=62, 99.9=116, 99.99=146] 
2018-12-30 10:12:56:072 380 sec: 3030027 operations; 9750.55 current ops/sec; est completion in 14 minutes [READ: Count=97537, Max=10327, Min=3, Avg=84.28, 90=250, 99=433, 99.9=618, 99.99=752] [READ-MODIFY-WRITE: Count=48630, Max=10527, Min=19, Avg=115.11, 90=298, 99=484, 99.9=675, 99.99=835] [UPDATE: Count=48626, Max=953, Min=13, Avg=29.78, 90=46, 99=62, 99.9=117, 99.99=139] 
2018-12-30 10:13:06:074 390 sec: 3125938 operations; 9590.14 current ops/sec; est completion in 14 minutes [READ: Count=95896, Max=77695, Min=3, Avg=85.47, 90=250, 99=431, 99.9=606, 99.99=726] [READ-MODIFY-WRITE: Count=48199, Max=26863, Min=18, Avg=117.46, 90=300, 99=486, 99.9=664, 99.99=822] [UPDATE: Count=48202, Max=26415, Min=13, Avg=30.92, 90=48, 99=63, 99.9=116, 99.99=139] 
2018-12-30 10:13:16:074 400 sec: 3220254 operations; 9430.66 current ops/sec; est completion in 14 minutes [READ: Count=94321, Max=130751, Min=2, Avg=87.92, 90=251, 99=432, 99.9=613, 99.99=889] [READ-MODIFY-WRITE: Count=47259, Max=103551, Min=14, Avg=119.37, 90=298, 99=483, 99.9=656, 99.99=836] [UPDATE: Count=47264, Max=1233, Min=9, Avg=29.61, 90=46, 99=61, 99.9=114, 99.99=140] 
2018-12-30 10:13:26:078 410 sec: 3314348 operations; 9406.58 current ops/sec; est completion in 13 minutes [READ: Count=94093, Max=114559, Min=3, Avg=87.08, 90=253, 99=431, 99.9=607, 99.99=780] [READ-MODIFY-WRITE: Count=47091, Max=114815, Min=16, Avg=121.52, 90=303, 99=486, 99.9=666, 99.99=860] [UPDATE: Count=47093, Max=28239, Min=10, Avg=31.64, 90=49, 99=64, 99.9=116, 99.99=136] 
2018-12-30 10:13:36:074 420 sec: 3410288 operations; 9596.88 current ops/sec; est completion in 13 minutes [READ: Count=95937, Max=19919, Min=3, Avg=84.29, 90=251, 99=432, 99.9=604, 99.99=745] [READ-MODIFY-WRITE: Count=48378, Max=107583, Min=16, Avg=119.04, 90=300, 99=484, 99.9=654, 99.99=827] [UPDATE: Count=48376, Max=107007, Min=11, Avg=32.91, 90=47, 99=62, 99.9=114, 99.99=141] 
2018-12-30 10:13:46:073 430 sec: 3509729 operations; 9946.09 current ops/sec; est completion in 13 minutes [READ: Count=99442, Max=11887, Min=3, Avg=82.46, 90=250, 99=425, 99.9=597, 99.99=722] [READ-MODIFY-WRITE: Count=49845, Max=856, Min=17, Avg=113.95, 90=298, 99=477, 99.9=642, 99.99=765] [UPDATE: Count=49834, Max=144, Min=12, Avg=29.6, 90=46, 99=61, 99.9=111, 99.99=134] 
2018-12-30 10:13:56:071 440 sec: 3606492 operations; 9677.27 current ops/sec; est completion in 13 minutes [READ: Count=96762, Max=78591, Min=1, Avg=84.16, 90=252, 99=428, 99.9=600, 99.99=738] [READ-MODIFY-WRITE: Count=48532, Max=95167, Min=9, Avg=117.43, 90=300, 99=482, 99.9=657, 99.99=850] [UPDATE: Count=48535, Max=95103, Min=4, Avg=31.81, 90=47, 99=62, 99.9=114, 99.99=137] 
2018-12-30 10:14:06:080 450 sec: 3702188 operations; 9561.95 current ops/sec; est completion in 12 minutes [READ: Count=95696, Max=19599, Min=2, Avg=85.57, 90=260, 99=433, 99.9=600, 99.99=786] [READ-MODIFY-WRITE: Count=47949, Max=20015, Min=15, Avg=118.48, 90=310, 99=488, 99.9=661, 99.99=1938] [UPDATE: Count=47958, Max=1920, Min=10, Avg=30.8, 90=49, 99=64, 99.9=117, 99.99=146] 
2018-12-30 10:14:16:074 460 sec: 3800798 operations; 9865.93 current ops/sec; est completion in 12 minutes [READ: Count=98610, Max=6975, Min=3, Avg=82.52, 90=254, 99=426, 99.9=590, 99.99=712] [READ-MODIFY-WRITE: Count=49364, Max=10927, Min=17, Avg=115.01, 90=303, 99=479, 99.9=644, 99.99=756] [UPDATE: Count=49361, Max=10351, Min=12, Avg=30.84, 90=49, 99=64, 99.9=115, 99.99=134] 
2018-12-30 10:14:26:072 470 sec: 3900370 operations; 9959.19 current ops/sec; est completion in 12 minutes [READ: Count=99571, Max=29999, Min=1, Avg=81.62, 90=253, 99=422, 99.9=593, 99.99=709] [READ-MODIFY-WRITE: Count=49908, Max=63743, Min=7, Avg=114.47, 90=301, 99=476, 99.9=653, 99.99=763] [UPDATE: Count=49902, Max=63359, Min=4, Avg=31.04, 90=46, 99=62, 99.9=113, 99.99=137] 
2018-12-30 10:14:36:073 480 sec: 4001349 operations; 10097.9 current ops/sec; est completion in 12 minutes [READ: Count=100983, Max=24927, Min=3, Avg=80.79, 90=252, 99=418, 99.9=574, 99.99=706] [READ-MODIFY-WRITE: Count=50403, Max=26623, Min=17, Avg=111.99, 90=300, 99=471, 99.9=616, 99.99=788] [UPDATE: Count=50404, Max=26239, Min=11, Avg=30.05, 90=47, 99=61, 99.9=110, 99.99=135] 
2018-12-30 10:14:46:079 490 sec: 4103388 operations; 10196.76 current ops/sec; est completion in 11 minutes [READ: Count=102036, Max=16671, Min=3, Avg=79.62, 90=250, 99=417, 99.9=580, 99.99=735] [READ-MODIFY-WRITE: Count=51161, Max=31231, Min=15, Avg=112.03, 90=299, 99=473, 99.9=642, 99.99=853] [UPDATE: Count=51165, Max=31087, Min=9, Avg=30.33, 90=47, 99=61, 99.9=111, 99.99=134] 
2018-12-30 10:14:56:074 500 sec: 4205831 operations; 10249.42 current ops/sec; est completion in 11 minutes [READ: Count=102447, Max=20975, Min=3, Avg=79.25, 90=250, 99=414, 99.9=568, 99.99=693] [READ-MODIFY-WRITE: Count=51428, Max=21279, Min=17, Avg=110.82, 90=298, 99=467, 99.9=630, 99.99=800] [UPDATE: Count=51428, Max=9727, Min=12, Avg=30, 90=47, 99=62, 99.9=113, 99.99=145] 
2018-12-30 10:15:06:175 510 sec: 4307809 operations; 10193.72 current ops/sec; est completion in 11 minutes [READ: Count=101972, Max=96063, Min=2, Avg=80.34, 90=250, 99=414, 99.9=576, 99.99=725] [READ-MODIFY-WRITE: Count=51170, Max=96511, Min=16, Avg=113.81, 90=299, 99=469, 99.9=632, 99.99=780] [UPDATE: Count=51167, Max=4875, Min=11, Avg=29.86, 90=47, 99=63, 99.9=117, 99.99=136] 
2018-12-30 10:15:16:070 520 sec: 4408482 operations; 10075.36 current ops/sec; est completion in 11 minutes [READ: Count=100674, Max=19631, Min=3, Avg=79.76, 90=252, 99=415, 99.9=566, 99.99=677] [READ-MODIFY-WRITE: Count=50270, Max=8895, Min=15, Avg=111.78, 90=301, 99=469, 99.9=633, 99.99=880] [UPDATE: Count=50270, Max=8263, Min=10, Avg=30.38, 90=48, 99=63, 99.9=116, 99.99=134] 
2018-12-30 10:15:26:079 530 sec: 4511751 operations; 10317.61 current ops/sec; est completion in 10 minutes [READ: Count=103274, Max=23519, Min=3, Avg=78.62, 90=253, 99=417, 99.9=569, 99.99=706] [READ-MODIFY-WRITE: Count=51662, Max=18351, Min=16, Avg=110.45, 90=302, 99=471, 99.9=633, 99.99=792] [UPDATE: Count=51662, Max=17887, Min=12, Avg=30.13, 90=47, 99=62, 99.9=115, 99.99=156] 
2018-12-30 10:15:36:074 540 sec: 4615991 operations; 10429.21 current ops/sec; est completion in 10 minutes [READ: Count=104237, Max=54655, Min=3, Avg=77.92, 90=250, 99=411, 99.9=560, 99.99=703] [READ-MODIFY-WRITE: Count=52093, Max=54975, Min=17, Avg=108.58, 90=297, 99=465, 99.9=613, 99.99=745] [UPDATE: Count=52094, Max=162, Min=12, Avg=29.5, 90=47, 99=62, 99.9=115, 99.99=134] 
2018-12-30 10:15:46:079 550 sec: 4719318 operations; 10328.57 current ops/sec; est completion in 10 minutes [READ: Count=103326, Max=40927, Min=3, Avg=77.34, 90=250, 99=411, 99.9=564, 99.99=706] [READ-MODIFY-WRITE: Count=51530, Max=112319, Min=17, Avg=111.24, 90=299, 99=466, 99.9=645, 99.99=778] [UPDATE: Count=51536, Max=111743, Min=12, Avg=32.44, 90=49, 99=64, 99.9=117, 99.99=141] 
2018-12-30 10:15:56:074 560 sec: 4822323 operations; 10304.62 current ops/sec; est completion in 10 minutes [READ: Count=103002, Max=28815, Min=2, Avg=78.67, 90=254, 99=414, 99.9=565, 99.99=708] [READ-MODIFY-WRITE: Count=51838, Max=49215, Min=11, Avg=110.78, 90=303, 99=470, 99.9=630, 99.99=1100] [UPDATE: Count=51835, Max=49055, Min=7, Avg=30.1, 90=48, 99=63, 99.9=118, 99.99=152] 
2018-12-30 10:16:06:076 570 sec: 4928300 operations; 10596.64 current ops/sec; est completion in 9 minutes [READ: Count=105987, Max=19615, Min=2, Avg=76.55, 90=252, 99=407, 99.9=567, 99.99=720] [READ-MODIFY-WRITE: Count=52917, Max=19967, Min=15, Avg=108.35, 90=301, 99=465, 99.9=629, 99.99=772] [UPDATE: Count=52911, Max=9039, Min=10, Avg=29.34, 90=48, 99=63, 99.9=118, 99.99=142] 
2018-12-30 10:16:16:074 580 sec: 5033481 operations; 10519.15 current ops/sec; est completion in 9 minutes [READ: Count=105172, Max=30655, Min=2, Avg=76.87, 90=252, 99=409, 99.9=556, 99.99=767] [READ-MODIFY-WRITE: Count=52481, Max=30975, Min=14, Avg=109.31, 90=301, 99=467, 99.9=632, 99.99=919] [UPDATE: Count=52484, Max=29679, Min=10, Avg=30.12, 90=48, 99=65, 99.9=119, 99.99=145] 
2018-12-30 10:16:26:070 590 sec: 5139030 operations; 10559.12 current ops/sec; est completion in 9 minutes [READ: Count=105553, Max=5503, Min=2, Avg=76.49, 90=252, 99=407, 99.9=554, 99.99=684] [READ-MODIFY-WRITE: Count=52762, Max=11151, Min=15, Avg=108.96, 90=302, 99=467, 99.9=612, 99.99=761] [UPDATE: Count=52762, Max=10687, Min=10, Avg=30.1, 90=49, 99=66, 99.9=120, 99.99=143] 
2018-12-30 10:16:36:071 600 sec: 5243955 operations; 10491.45 current ops/sec; est completion in 9 minutes [READ: Count=104921, Max=86335, Min=2, Avg=77.23, 90=251, 99=404, 99.9=537, 99.99=668] [READ-MODIFY-WRITE: Count=52589, Max=86719, Min=15, Avg=110.43, 90=301, 99=460, 99.9=601, 99.99=782] [UPDATE: Count=52595, Max=162, Min=10, Avg=29.69, 90=49, 99=65, 99.9=120, 99.99=140] 
2018-12-30 10:16:46:071 610 sec: 5350356 operations; 10641.16 current ops/sec; est completion in 8 minutes [READ: Count=106403, Max=93951, Min=3, Avg=76.17, 90=252, 99=400, 99.9=548, 99.99=706] [READ-MODIFY-WRITE: Count=53086, Max=19807, Min=12, Avg=106.59, 90=301, 99=459, 99.9=611, 99.99=1356] [UPDATE: Count=53085, Max=15615, Min=8, Avg=29.45, 90=48, 99=64, 99.9=120, 99.99=142] 
2018-12-30 10:16:56:073 620 sec: 5456673 operations; 10629.57 current ops/sec; est completion in 8 minutes [READ: Count=106316, Max=114623, Min=2, Avg=76.52, 90=253, 99=400, 99.9=547, 99.99=691] [READ-MODIFY-WRITE: Count=53078, Max=30463, Min=15, Avg=106.48, 90=301, 99=459, 99.9=621, 99.99=836] [UPDATE: Count=53077, Max=2747, Min=9, Avg=28.95, 90=48, 99=65, 99.9=120, 99.99=144] 
2018-12-30 10:17:06:072 630 sec: 5565824 operations; 10915.1 current ops/sec; est completion in 8 minutes [READ: Count=109150, Max=17839, Min=3, Avg=74.02, 90=250, 99=397, 99.9=539, 99.99=682] [READ-MODIFY-WRITE: Count=54357, Max=18159, Min=16, Avg=104.72, 90=298, 99=456, 99.9=614, 99.99=782] [UPDATE: Count=54358, Max=7895, Min=10, Avg=29.11, 90=48, 99=64, 99.9=121, 99.99=144] 
2018-12-30 10:17:16:071 640 sec: 5673283 operations; 10746.97 current ops/sec; est completion in 8 minutes [READ: Count=107460, Max=45759, Min=2, Avg=74.54, 90=250, 99=395, 99.9=533, 99.99=737] [READ-MODIFY-WRITE: Count=53655, Max=48703, Min=15, Avg=107.01, 90=301, 99=457, 99.9=608, 99.99=791] [UPDATE: Count=53647, Max=48543, Min=10, Avg=30.64, 90=50, 99=66, 99.9=124, 99.99=146] 
2018-12-30 10:17:26:079 650 sec: 5783513 operations; 11015.29 current ops/sec; est completion in 7 minutes [READ: Count=110233, Max=10535, Min=2, Avg=73.43, 90=249, 99=391, 99.9=518, 99.99=723] [READ-MODIFY-WRITE: Count=54932, Max=10855, Min=14, Avg=104.12, 90=298, 99=451, 99.9=585, 99.99=993] [UPDATE: Count=54935, Max=160, Min=9, Avg=28.6, 90=47, 99=64, 99.9=121, 99.99=142] 
2018-12-30 10:17:36:074 660 sec: 5894487 operations; 11101.84 current ops/sec; est completion in 7 minutes [READ: Count=110970, Max=18623, Min=2, Avg=72.74, 90=248, 99=388, 99.9=524, 99.99=694] [READ-MODIFY-WRITE: Count=55026, Max=760, Min=14, Avg=102.55, 90=296, 99=448, 99.9=606, 99.99=703] [UPDATE: Count=55021, Max=157, Min=10, Avg=28.78, 90=48, 99=64, 99.9=121, 99.99=141] 
2018-12-30 10:17:46:078 670 sec: 6006681 operations; 11216.04 current ops/sec; est completion in 7 minutes [READ: Count=112197, Max=13503, Min=2, Avg=71.52, 90=247, 99=384, 99.9=516, 99.99=619] [READ-MODIFY-WRITE: Count=56067, Max=13623, Min=14, Avg=102.62, 90=296, 99=447, 99.9=590, 99.99=713] [UPDATE: Count=56069, Max=12367, Min=9, Avg=29.18, 90=48, 99=65, 99.9=125, 99.99=146] 
2018-12-30 10:17:56:074 680 sec: 6119419 operations; 11278.31 current ops/sec; est completion in 7 minutes [READ: Count=112741, Max=21023, Min=2, Avg=71.38, 90=248, 99=387, 99.9=507, 99.99=662] [READ-MODIFY-WRITE: Count=56439, Max=31695, Min=13, Avg=101.34, 90=296, 99=445, 99.9=574, 99.99=745] [UPDATE: Count=56445, Max=31583, Min=8, Avg=28.53, 90=46, 99=61, 99.9=117, 99.99=143] 
2018-12-30 10:18:06:070 690 sec: 6231226 operations; 11184.06 current ops/sec; est completion in 6 minutes [READ: Count=111807, Max=118591, Min=2, Avg=71.92, 90=247, 99=383, 99.9=515, 99.99=661] [READ-MODIFY-WRITE: Count=56017, Max=21999, Min=13, Avg=101.4, 90=295, 99=445, 99.9=576, 99.99=742] [UPDATE: Count=56015, Max=21871, Min=9, Avg=28.86, 90=48, 99=64, 99.9=123, 99.99=144] 
2018-12-30 10:18:16:074 700 sec: 6338524 operations; 10725.51 current ops/sec; est completion in 6 minutes [READ: Count=107292, Max=117631, Min=2, Avg=75.75, 90=246, 99=383, 99.9=512, 99.99=1459] [READ-MODIFY-WRITE: Count=53969, Max=102271, Min=11, Avg=105.62, 90=294, 99=444, 99.9=589, 99.99=7923] [UPDATE: Count=53969, Max=14159, Min=7, Avg=28.72, 90=47, 99=64, 99.9=123, 99.99=162] 
2018-12-30 10:18:26:079 710 sec: 6416130 operations; 7757.5 current ops/sec; est completion in 6 minutes [READ: Count=77628, Max=187135, Min=0, Avg=115.35, 90=229, 99=418, 99.9=1890, 99.99=115263] [READ-MODIFY-WRITE: Count=38934, Max=118975, Min=5, Avg=127.55, 90=269, 99=474, 99.9=1501, 99.99=97983] [UPDATE: Count=38946, Max=282, Min=3, Avg=20.48, 90=39, 99=63, 99.9=107, 99.99=195] 
2018-12-30 10:18:36:074 720 sec: 6523073 operations; 10698.58 current ops/sec; est completion in 6 minutes [READ: Count=106924, Max=123263, Min=1, Avg=78.76, 90=228, 99=375, 99.9=928, 99.99=57023] [READ-MODIFY-WRITE: Count=53617, Max=123583, Min=5, Avg=103.38, 90=269, 99=433, 99.9=1006, 99.99=58335] [UPDATE: Count=53623, Max=371, Min=3, Avg=23.52, 90=39, 99=59, 99.9=104, 99.99=135] 
2018-12-30 10:18:46:079 730 sec: 6646712 operations; 12357.72 current ops/sec; est completion in 6 minutes [READ: Count=123641, Max=103871, Min=2, Avg=64.58, 90=230, 99=347, 99.9=448, 99.99=622] [READ-MODIFY-WRITE: Count=61683, Max=104127, Min=11, Avg=93.75, 90=272, 99=404, 99.9=537, 99.99=687] [UPDATE: Count=61671, Max=4171, Min=8, Avg=26.4, 90=41, 99=56, 99.9=106, 99.99=130] 
2018-12-30 10:18:56:075 740 sec: 6770401 operations; 12375.09 current ops/sec; est completion in 5 minutes [READ: Count=123692, Max=39871, Min=2, Avg=64.14, 90=233, 99=350, 99.9=445, 99.99=635] [READ-MODIFY-WRITE: Count=61797, Max=40383, Min=14, Avg=92.35, 90=276, 99=405, 99.9=509, 99.99=841] [UPDATE: Count=61797, Max=5111, Min=9, Avg=26.87, 90=42, 99=56, 99.9=106, 99.99=127] 
2018-12-30 10:19:06:075 750 sec: 6897980 operations; 12756.62 current ops/sec; est completion in 5 minutes [READ: Count=127574, Max=35295, Min=3, Avg=62.14, 90=230, 99=345, 99.9=436, 99.99=586] [READ-MODIFY-WRITE: Count=63850, Max=7047, Min=15, Avg=89.5, 90=271, 99=399, 99.9=492, 99.99=638] [UPDATE: Count=63843, Max=147, Min=10, Avg=26.18, 90=41, 99=55, 99.9=104, 99.99=123] 
2018-12-30 10:19:16:074 760 sec: 7026109 operations; 12814.18 current ops/sec; est completion in 5 minutes [READ: Count=128129, Max=23679, Min=3, Avg=61.4, 90=227, 99=342, 99.9=430, 99.99=588] [READ-MODIFY-WRITE: Count=63716, Max=23983, Min=15, Avg=90, 90=269, 99=394, 99.9=485, 99.99=634] [UPDATE: Count=63716, Max=18095, Min=10, Avg=26.89, 90=41, 99=57, 99.9=104, 99.99=127] 
2018-12-30 10:19:26:075 770 sec: 7152879 operations; 12675.73 current ops/sec; est completion in 5 minutes [READ: Count=126773, Max=108607, Min=1, Avg=62.29, 90=229, 99=342, 99.9=449, 99.99=690] [READ-MODIFY-WRITE: Count=63258, Max=13815, Min=6, Avg=90.13, 90=273, 99=401, 99.9=518, 99.99=746] [UPDATE: Count=63258, Max=13639, Min=4, Avg=27.01, 90=42, 99=59, 99.9=107, 99.99=134] 
2018-12-30 10:19:36:074 780 sec: 7283012 operations; 13014.6 current ops/sec; est completion in 4 minutes [READ: Count=130131, Max=23247, Min=3, Avg=60.32, 90=227, 99=336, 99.9=433, 99.99=563] [READ-MODIFY-WRITE: Count=65097, Max=23535, Min=15, Avg=89.23, 90=269, 99=396, 99.9=488, 99.99=633] [UPDATE: Count=65103, Max=13999, Min=10, Avg=26.89, 90=41, 99=58, 99.9=105, 99.99=129] 
2018-12-30 10:19:46:079 790 sec: 7411466 operations; 12840.26 current ops/sec; est completion in 4 minutes [READ: Count=128455, Max=107391, Min=3, Avg=61.62, 90=227, 99=340, 99.9=438, 99.99=654] [READ-MODIFY-WRITE: Count=64116, Max=92735, Min=14, Avg=89.44, 90=269, 99=395, 99.9=494, 99.99=706] [UPDATE: Count=64114, Max=143, Min=10, Avg=26.44, 90=41, 99=57, 99.9=105, 99.99=125] 
2018-12-30 10:19:56:074 800 sec: 7540554 operations; 12913.97 current ops/sec; est completion in 4 minutes [READ: Count=129090, Max=27327, Min=3, Avg=60.46, 90=229, 99=340, 99.9=436, 99.99=608] [READ-MODIFY-WRITE: Count=64378, Max=105471, Min=13, Avg=89.59, 90=271, 99=393, 99.9=501, 99.99=717] [UPDATE: Count=64380, Max=105279, Min=9, Avg=27.88, 90=41, 99=57, 99.9=107, 99.99=142] 
2018-12-30 10:20:06:070 810 sec: 7672294 operations; 13179.27 current ops/sec; est completion in 4 minutes [READ: Count=131734, Max=26207, Min=3, Avg=59.55, 90=227, 99=333, 99.9=428, 99.99=604] [READ-MODIFY-WRITE: Count=66089, Max=26447, Min=14, Avg=87.84, 90=270, 99=389, 99.9=486, 99.99=684] [UPDATE: Count=66092, Max=9359, Min=9, Avg=26.29, 90=41, 99=56, 99.9=107, 99.99=133] 
2018-12-30 10:20:16:074 820 sec: 7805445 operations; 13309.78 current ops/sec; est completion in 3 minutes [READ: Count=133155, Max=7467, Min=3, Avg=58.69, 90=226, 99=321, 99.9=423, 99.99=597] [READ-MODIFY-WRITE: Count=66623, Max=5155, Min=15, Avg=86.67, 90=269, 99=384, 99.9=476, 99.99=658] [UPDATE: Count=66611, Max=157, Min=10, Avg=26.63, 90=42, 99=57, 99.9=108, 99.99=131] 
2018-12-30 10:20:26:075 830 sec: 7938877 operations; 13343.2 current ops/sec; est completion in 3 minutes [READ: Count=133428, Max=38239, Min=2, Avg=58.99, 90=226, 99=320, 99.9=421, 99.99=567] [READ-MODIFY-WRITE: Count=66631, Max=38591, Min=11, Avg=86.94, 90=267, 99=387, 99.9=480, 99.99=614] [UPDATE: Count=66640, Max=6047, Min=7, Avg=25.95, 90=41, 99=56, 99.9=108, 99.99=134] 
2018-12-30 10:20:36:074 840 sec: 8072100 operations; 13323.63 current ops/sec; est completion in 3 minutes [READ: Count=133230, Max=27583, Min=2, Avg=59.49, 90=228, 99=324, 99.9=424, 99.99=566] [READ-MODIFY-WRITE: Count=66593, Max=27631, Min=11, Avg=86.45, 90=269, 99=386, 99.9=484, 99.99=632] [UPDATE: Count=66595, Max=14551, Min=8, Avg=25.29, 90=40, 99=57, 99.9=110, 99.99=137] 
2018-12-30 10:20:46:071 850 sec: 8207757 operations; 13569.77 current ops/sec; est completion in 3 minutes [READ: Count=135650, Max=66623, Min=2, Avg=58.34, 90=225, 99=315, 99.9=430, 99.99=594] [READ-MODIFY-WRITE: Count=67898, Max=27919, Min=13, Avg=84.52, 90=266, 99=380, 99.9=488, 99.99=637] [UPDATE: Count=67899, Max=155, Min=9, Avg=24.92, 90=40, 99=56, 99.9=110, 99.99=127] 
2018-12-30 10:20:56:074 860 sec: 8340348 operations; 13255.12 current ops/sec; est completion in 2 minutes [READ: Count=132594, Max=97919, Min=1, Avg=59.61, 90=229, 99=324, 99.9=432, 99.99=573] [READ-MODIFY-WRITE: Count=66256, Max=98495, Min=11, Avg=87.97, 90=272, 99=385, 99.9=492, 99.99=659] [UPDATE: Count=66248, Max=14623, Min=7, Avg=25.68, 90=41, 99=58, 99.9=114, 99.99=149] 
2018-12-30 10:21:06:075 870 sec: 8476795 operations; 13641.97 current ops/sec; est completion in 2 minutes [READ: Count=136446, Max=31599, Min=1, Avg=57.87, 90=226, 99=316, 99.9=423, 99.99=552] [READ-MODIFY-WRITE: Count=68004, Max=31663, Min=7, Avg=85.15, 90=268, 99=380, 99.9=476, 99.99=605] [UPDATE: Count=68005, Max=7167, Min=4, Avg=25.16, 90=40, 99=56, 99.9=111, 99.99=134] 
2018-12-30 10:21:16:075 880 sec: 8611780 operations; 13499.85 current ops/sec; est completion in 2 minutes [READ: Count=134985, Max=24991, Min=2, Avg=58.58, 90=228, 99=322, 99.9=428, 99.99=595] [READ-MODIFY-WRITE: Count=67242, Max=25423, Min=10, Avg=85.33, 90=269, 99=387, 99.9=489, 99.99=636] [UPDATE: Count=67240, Max=160, Min=7, Avg=25.16, 90=41, 99=58, 99.9=114, 99.99=134] 
2018-12-30 10:21:26:075 890 sec: 8748674 operations; 13689.4 current ops/sec; est completion in 2 minutes [READ: Count=136891, Max=24191, Min=2, Avg=57.11, 90=225, 99=314, 99.9=419, 99.99=571] [READ-MODIFY-WRITE: Count=68471, Max=94463, Min=12, Avg=84.23, 90=266, 99=374, 99.9=485, 99.99=614] [UPDATE: Count=68478, Max=94335, Min=9, Avg=26.08, 90=40, 99=56, 99.9=112, 99.99=130] 
2018-12-30 10:21:36:071 900 sec: 8885692 operations; 13707.28 current ops/sec; est completion in 1 minute [READ: Count=137024, Max=111871, Min=1, Avg=57.55, 90=224, 99=313, 99.9=417, 99.99=580] [READ-MODIFY-WRITE: Count=68533, Max=112063, Min=5, Avg=85.46, 90=266, 99=371, 99.9=478, 99.99=645] [UPDATE: Count=68536, Max=28847, Min=3, Avg=25.05, 90=40, 99=57, 99.9=114, 99.99=138] 
2018-12-30 10:21:46:071 910 sec: 9023420 operations; 13772.8 current ops/sec; est completion in 1 minute [READ: Count=137723, Max=27183, Min=2, Avg=57.29, 90=226, 99=314, 99.9=412, 99.99=554] [READ-MODIFY-WRITE: Count=68845, Max=27247, Min=12, Avg=84.5, 90=268, 99=370, 99.9=469, 99.99=580] [UPDATE: Count=68843, Max=162, Min=8, Avg=24.92, 90=40, 99=57, 99.9=110, 99.99=133] 
2018-12-30 10:21:56:074 920 sec: 9163554 operations; 14007.8 current ops/sec; est completion in 1 minute [READ: Count=140136, Max=13743, Min=2, Avg=55.69, 90=223, 99=310, 99.9=412, 99.99=544] [READ-MODIFY-WRITE: Count=70030, Max=83071, Min=12, Avg=82.92, 90=264, 99=370, 99.9=475, 99.99=621] [UPDATE: Count=70032, Max=82943, Min=9, Avg=25.75, 90=40, 99=56, 99.9=112, 99.99=143] 
2018-12-30 10:22:06:079 930 sec: 9304640 operations; 14102.96 current ops/sec; est completion in 1 minute [READ: Count=141086, Max=40159, Min=2, Avg=55.45, 90=223, 99=309, 99.9=408, 99.99=560] [READ-MODIFY-WRITE: Count=70806, Max=40351, Min=12, Avg=82.21, 90=264, 99=365, 99.9=471, 99.99=640] [UPDATE: Count=70798, Max=29567, Min=8, Avg=25.14, 90=40, 99=57, 99.9=114, 99.99=140] 
2018-12-30 10:22:16:074 940 sec: 9442776 operations; 13819.13 current ops/sec; est completion in 56 seconds [READ: Count=138139, Max=83327, Min=1, Avg=56.84, 90=224, 99=312, 99.9=408, 99.99=569] [READ-MODIFY-WRITE: Count=69088, Max=27231, Min=9, Avg=82.88, 90=266, 99=369, 99.9=477, 99.99=697] [UPDATE: Count=69093, Max=4663, Min=6, Avg=25.18, 90=41, 99=59, 99.9=117, 99.99=139] 
2018-12-30 10:22:26:079 950 sec: 9579521 operations; 13667.67 current ops/sec; est completion in 42 seconds [READ: Count=136744, Max=112831, Min=0, Avg=57.66, 90=222, 99=307, 99.9=407, 99.99=574] [READ-MODIFY-WRITE: Count=68617, Max=113215, Min=4, Avg=84.37, 90=261, 99=362, 99.9=472, 99.99=894] [UPDATE: Count=68616, Max=110655, Min=3, Avg=25.41, 90=38, 99=55, 99.9=109, 99.99=139] 
2018-12-30 10:22:36:074 960 sec: 9721435 operations; 14198.5 current ops/sec; est completion in 28 seconds [READ: Count=141913, Max=28591, Min=2, Avg=55.73, 90=223, 99=308, 99.9=404, 99.99=543] [READ-MODIFY-WRITE: Count=70968, Max=28799, Min=11, Avg=81.41, 90=262, 99=362, 99.9=468, 99.99=607] [UPDATE: Count=70972, Max=1210, Min=8, Avg=23.84, 90=39, 99=56, 99.9=109, 99.99=132] 
2018-12-30 10:22:46:073 970 sec: 9864887 operations; 14346.63 current ops/sec; est completion in 14 seconds [READ: Count=143448, Max=108927, Min=2, Avg=55.18, 90=220, 99=304, 99.9=408, 99.99=547] [READ-MODIFY-WRITE: Count=71968, Max=38271, Min=7, Avg=79.45, 90=258, 99=355, 99.9=472, 99.99=604] [UPDATE: Count=71968, Max=37855, Min=4, Avg=23.49, 90=37, 99=54, 99.9=108, 99.99=128] 
2018-12-30 10:22:55:497 979 sec: 10000000 operations; 14338.64 current ops/sec; [READ: Count=135112, Max=25135, Min=2, Avg=54.49, 90=220, 99=306, 99.9=406, 99.99=532] [READ-MODIFY-WRITE: Count=67607, Max=70399, Min=10, Avg=80.61, 90=259, 99=356, 99.9=462, 99.99=603] [CLEANUP: Count=1, Max=40895, Min=40864, Avg=40880, 90=40895, 99=40895, 99.9=40895, 99.99=40895] [UPDATE: Count=67590, Max=70271, Min=7, Avg=24.33, 90=38, 99=53, 99.9=109, 99.99=135] 
[OVERALL], RunTime(ms), 979427
[OVERALL], Throughput(ops/sec), 10210.051387188632
[TOTAL_GCS_PS_Scavenge], Count, 198
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 6834
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6977549118004711
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 198
[TOTAL_GC_TIME], Time(ms), 6834
[TOTAL_GC_TIME_%], Time(%), 0.6977549118004711
[READ], Operations, 10000000
[READ], AverageLatency(us), 80.2520069
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 187135
[READ], 95thPercentileLatency(us), 300
[READ], 99thPercentileLatency(us), 445
[READ], Return=OK, 10000000
[READ-MODIFY-WRITE], Operations, 5002084
[READ-MODIFY-WRITE], AverageLatency(us), 110.54478733263976
[READ-MODIFY-WRITE], MinLatency(us), 4
[READ-MODIFY-WRITE], MaxLatency(us), 185855
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 348
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 498
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 40880.0
[CLEANUP], MinLatency(us), 40864
[CLEANUP], MaxLatency(us), 40895
[CLEANUP], 95thPercentileLatency(us), 40895
[CLEANUP], 99thPercentileLatency(us), 40895
[UPDATE], Operations, 5002084
[UPDATE], AverageLatency(us), 28.625611844983013
[UPDATE], MinLatency(us), 3
[UPDATE], MaxLatency(us), 111743
[UPDATE], 95thPercentileLatency(us), 49
[UPDATE], 99thPercentileLatency(us), 61
[UPDATE], Return=OK, 5002084